Tekla Open API Reference for Tekla Structures 2025
Model.SelectModelObject Method
 Takes as input an identifier to an object and then checks its type and instantiates and selects it before returning it.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject SelectModelObject(
	Identifier ID
)
Public Function SelectModelObject (
	ID As Identifier
) As ModelObject
Parameters
ID
Type: Tekla.Structures.Identifier
The identifier of the model object that is to be selected.
Return Value
Type: ModelObject
The selected model object with the given identifier, or null if object does not exists or object data loading failed for some reason.
See Also
Reference
Model Class
Tekla.Structures.Model Namespace